## Plan Result (demo)




<pre><code>Plan: 2 to add, 1 to change, 0 to destroy.</code></pre>

* Create
  * azurerm_key_vault_access_policy.this
  * azurerm_user_assigned_identity.this
* Update
  * azurerm_windows_function_app.this




<details><summary>Change Result (Click me)</summary>

```hcl

  # azurerm_key_vault_access_policy.this will be created
  + resource "azurerm_key_vault_access_policy" "this" {
      + id                 = (known after apply)
      + key_vault_id       = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/genesis-rg/providers/Microsoft.KeyVault/vaults/dcdcftappsdemokv"
      + object_id          = (known after apply)
      + secret_permissions = [
          + "Get",
        ]
      + tenant_id          = "531ff96d-0ae9-462a-8d2d-bec7c0b42082"
    }

  # azurerm_user_assigned_identity.this will be created
  + resource "azurerm_user_assigned_identity" "this" {
      + client_id           = (known after apply)
      + id                  = (known after apply)
      + location            = "uksouth"
      + name                = "alerts-slack-demo"
      + principal_id        = (known after apply)
      + resource_group_name = "alerts-slack-demo"
      + tenant_id           = (known after apply)
    }

  # azurerm_windows_function_app.this will be updated in-place
  ~ resource "azurerm_windows_function_app" "this" {
      ~ app_settings                                   = {
          - "AzureWebJobsFeatureFlags" = "EnableWorkerIndexing"
        } -> (known after apply)
        id                                             = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/alerts-slack-demo/providers/Microsoft.Web/sites/alerts-slack-demo"
        name                                           = "alerts-slack-demo"
        tags                                           = {
            "application"  = "core"
            "builtFrom"    = "hmcts/azure-alert-to-slack-function"
            "businessArea" = "CFT"
            "criticality"  = "Medium"
            "environment"  = "demo"
            "startupMode"  = "always"
        }
        # (26 unchanged attributes hidden)

      + identity {
          + identity_ids = (known after apply)
          + type         = "UserAssigned"
        }

        # (1 unchanged block hidden)
    }

Plan: 2 to add, 1 to change, 0 to destroy.
```

</details>





<!-- github-comment: {"Command":"plan","PRNumber":15,"Program":"tfcmt","SHA1":"","Target":"demo","Vars":{}} -->